Tekla Open API Reference for Tekla Structures 2025
ViewCamera Methods
The ViewCamera type exposes the following members.
Methods
Name | Description
Modify
Updates the camera to the application view.
Select
Updates the camera parameters from the application view.
Top
See Also
Reference
ViewCamera Class
Tekla.Structures.Model.UI Namespace